notes/linux/polybar_font_config.org
#+title: polybar字体配置

* 看那些字体可以用：
polybar 使用 fontconfig 来匹配字体，所以需要用 fc-list 获取字体名称，在命令行运行:
#+BEGIN_SRC shell
  fc-list
#+END_SRC

#+BEGIN_SRC shell
/usr/share/fonts/TTF/polybar-icons.ttf: icomoon:style=Regular
/usr/share/fonts/TTF/icons.ttf: Icons:style=Regular
#+END_SRC
其中 icomoon, Icons 即要用到的字体名称

* 在 polybar 中配置字体
配置如下：
#+BEGIN_SRC shell
  font-0 = Icons:size=12;0
  font-1 = icomoon:size=12;0
  font-2 = MaterialIcons:size=12;0
  font-3 = 思源黑体 CN Regular:size=10;-1
#+END_SRC
font-0 表示 font 列表的第 0 项，font-1 即列表第二项......

* 都有哪些符号可用
polybar 官方使用 gucharmap 工具查看可用符号，需要注意：gucharmap 中选择字体后，打开菜单中：查看 -> 只显示来自此字形的字体

选择要用的字符，在左下角会显示字符的编码

* 在 polybar 中使用字体中的图标
在 polybar 的配置文件中把图标符号直接输入到配置中即可，比如：
#+BEGIN_SRC 
[module/androidMenu]
  type=custom/text
  content = "||"
#+END_SRC
上述配置中的 content 的字符串会原样显示在 polybar 中。

* emacs 中输入字符的方法
#+BEGIN_SRC 
C-x 8 Enter
#+END_SRC
然后输入字符的编码值即可


